IDEA StatiCa Open Model
SubStructure.Geometry Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Geometry
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public SubStructureGeometry Geometry { get; set; }
Public Property Geometry As SubStructureGeometry
	Get
	Set
public:
property SubStructureGeometry^ Geometry {
	SubStructureGeometry^ get ();
	void set (SubStructureGeometry^ value);
}
Property Value
Type: SubStructureGeometry
See Also
Reference
SubStructure Class
IdeaRS.OpenModel.Model Namespace